/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcapitalize.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjung <hyunjung@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/09/16 12:01:48 by hyunjung          #+#    #+#             */
/*   Updated: 2021/09/16 12:10:00 by hyunjung         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

char *ft_strcapitalize(char *str)
{
	//2번째 줄을 보면 패턴이 특수문자 뒤에 대문자로 처리된다.
	//그것을 활용해 보자.
}